Revit 2027 API
FabricationPart.Weight Property
 The weight of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Weight { get; }
Public ReadOnly Property Weight As Double
	Get
public:
property double Weight {
	double get ();
}
member Weight : float with get
Property Value
Double
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace